//   || - или
//   && - и

//Напишите программу, которая принимает
//на вход число и проверяет, кратно ли оно одновременно 7 и 23

// сырое решение

int num = 54;

if (num % 7 == 0 && num % 23 == 0) ;
    Console.WriteLine("делится");
